09-ponto-de-entrada.org
#+setupfile: static/setupfile.org
#+html_link_up: index.html
#+title: Ponto de Entrada
#+startup: content

#+property: header-args:rust :tangle src/main.rs

Arquivo: ~main.rs~.

* Declarando módulos

#+begin_src rust
#![feature(seek_stream_len)]

pub mod core;
pub mod axioms;
pub mod printing;
pub mod evaluator;
pub mod reader;

#[cfg(test)]
mod tests;
#+end_src

* Importações

#+begin_src rust
use self::core::{ Maj, MajState };
use self::printing::{ maj_format, maj_format_raw };
use self::evaluator::maj_eval;
use self::reader::tokenizer::maj_tokenize;
use self::reader::parser::maj_parse;
#+end_src

