doc/html/09-ponto-de-entrada.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2023-01-27 sex 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ponto de Entrada</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Ponto de Entrada</h1>
<p>
Arquivo: <code>main.rs</code>.
</p>

<div id="outline-container-org4106f5a" class="outline-2">
<h2 id="org4106f5a"><span class="section-number-2">1.</span> Declarando módulos</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#![feature(seek_stream_len)]</span>

<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">core</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">axioms</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">printing</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">evaluator</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">reader</span>;

<span style="color: #c586c0;">#[cfg(test)]</span>
<span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">tests</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org06ea119" class="outline-2">
<h2 id="org06ea119"><span class="section-number-2">2.</span> Importações</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">self</span>::<span style="color: #569cd6;">core</span>::{ <span style="color: #4ec9b0;">Maj</span>, <span style="color: #4ec9b0;">MajState</span> };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">self</span>::<span style="color: #569cd6;">printing</span>::{ maj_format, maj_format_raw };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">self</span>::<span style="color: #569cd6;">evaluator</span>::maj_eval;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">self</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">tokenizer</span>::maj_tokenize;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">self</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">parser</span>::maj_parse;
</pre>
</div>
</div>
</div>
