09-ponto-de-entrada.org
* REPL

#+begin_src rust
use rustyline::error::ReadlineError;
use rustyline::Editor;
use rustyline::validate::{
    ValidationContext,
    ValidationResult,
    Validator
};
use rustyline_derive::{Completer, Helper, Highlighter, Hinter};
use colored::*;
use std::{ env, process };
#+end_src

#+begin_src rust
#[derive(Completer, Helper, Highlighter, Hinter)]
struct MajInputValidator {}

impl Validator for MajInputValidator {
    fn validate(
        &self,
        ctx: &mut ValidationContext
    ) -> Result<ValidationResult, ReadlineError> {
        use ValidationResult::{
            Incomplete,
            Invalid,
            Valid
        };

        let input = ctx.input();
        let mut ignore_one = false;
        let mut count = 0;
        for c in input.chars() {
            if ignore_one {
                ignore_one = false;
            } else {
                match c {
                    '(' => {
                        count += 1;
                    },
                    ')' => {
                        if count == 0 {
                            count = -1;
                            break;
                        } else {
                            count -= 1;
                        }
                    },
                    '\\' => {
                        // Gambiarra for preventing
                        // incomplete input on characters
                        // such as #\( and #\)
                        ignore_one = true;
                    }
                    _ => {},
                }
            }
        }

        if count > 0 {
            Ok(Incomplete)
        } else if count < 0 {
            Ok(
                Invalid(Some("No matching parenthesis found"
                             .to_owned()))
            )
        } else {
            Ok(Valid(None))
        }
    }
}
#+end_src

#+begin_src rust
fn repl(mut state: &mut MajState, options: &ArgsOptions) {
    use crate::axioms::predicates::maj_errorp;
    if !options.silent {
        println!("Press C-c or C-d to quit");
    }

    let validator = MajInputValidator {};

    let mut rl = Editor::new();
    rl.set_helper(Some(validator));
    let _ = rl.load_history(".majestic_history");
    let mut prompt = if options.silent {
        String::from("")
    } else {
        format!("{}", "> ".green())
    };

    let mut show_tokens = false;

    loop {
        let readline = rl.readline(&prompt);
        match readline {
            Ok(line) => {
                rl.add_history_entry(line.as_str());
                if line == "#t" {
                    show_tokens = !show_tokens;
                    prompt =
                        if options.silent {
                            String::from("")
                        } else if show_tokens {
                            format!("{}", "> ".magenta())
                        } else {
                            format!("{}", "> ".green())
                        };
                } else {
                    //use crate::printing::maj_pretty_format;
                    match maj_tokenize(line.as_ref()) {
                        Ok(tokens) => {
                            if show_tokens {
                                println!("{}",
                                         format!("{:?}", tokens)
                                         .magenta());
                            }
                            match maj_parse(&mut state,
                                                  tokens.clone()) {
                                Ok(expressions) => {
                                    if show_tokens {
                                        println!("{}",
                                                 maj_format_raw(
                                                     &state,
                                                     expressions.clone(),
                                                     false).magenta());
                                    }
                                    use crate::axioms::utils::{
                                        STACK_RED_ZONE,
                                        STACK_PER_RECURSION
                                    };
                                    let results =
                                        stacker::maybe_grow(
                                            STACK_RED_ZONE,
                                            STACK_PER_RECURSION,
                                            || maj_eval(&mut state,
                                                        Maj::cons(
                                                            Maj::do_sym(),
                                                            expressions),
                                                        Maj::nil()));
                                            if !maj_errorp(results.clone()).to_bool() {
                                                println!("{}",
                                                         maj_format(&state, results)
                                                         .cyan());
                                            } else {
                                                eprintln!("{} {}",
                                                          "Error:".red().bold(),
                                                          maj_format(&state, results));
                                            }
                                            
                                        },
                                    Err(msg) =>
                                        eprintln!("{} {}",
                                                  "Parser error:".red().bold(),
                                                  msg),
                                }
                            },
                            Err((line, msg)) =>
                                eprintln!("{} on line {}: {}",
                                          "Syntax error".red().bold(),
                                          line, msg),
                        };
                    }
                },
                Err(ReadlineError::Interrupted) => {
                    if !options.silent {
                        println!("{}", "C-c".cyan().dimmed());
                    }
                    break
                },
                Err(ReadlineError::Eof) => {
                    if !options.silent {
                        println!("{}", "C-d".cyan().dimmed());
                    }
                    break
                },
                Err(err) => {
                    eprintln!("REPL Error: {:?}", err);
                    break
                }
            }
        }

        if let Err(_) = rl.save_history(".majestic_history") {
            eprintln!("Failed saving history to .majestic_history.");
        }

        if !options.silent {
            println!("Quaerendo invenietis.");
        }
    }
#+end_src

