doc/html/09-ponto-de-entrada.html

<div id="outline-container-org0e848cc" class="outline-2">
<h2 id="org0e848cc"><span class="section-number-2">3.</span> REPL</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">rustyline</span>::<span style="color: #569cd6;">error</span>::<span style="color: #4ec9b0;">ReadlineError</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">rustyline</span>::<span style="color: #4ec9b0;">Editor</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">rustyline</span>::<span style="color: #569cd6;">validate</span>::{
    <span style="color: #4ec9b0;">ValidationContext</span>,
    <span style="color: #4ec9b0;">ValidationResult</span>,
    <span style="color: #4ec9b0;">Validator</span>
};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">rustyline_derive</span>::{<span style="color: #4ec9b0;">Completer</span>, <span style="color: #4ec9b0;">Helper</span>, <span style="color: #4ec9b0;">Highlighter</span>, <span style="color: #4ec9b0;">Hinter</span>};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">colored</span>::*;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::{ env, process };
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Completer, Helper, Highlighter, Hinter)]</span>
<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">MajInputValidator</span> {}

<span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Validator</span> <span style="color: #569cd6;">for</span> <span style="color: #4ec9b0;">MajInputValidator</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">validate</span>(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>,
        <span style="color: #9cdcfe;">ctx</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">ValidationContext</span>
    ) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">ValidationResult</span>, <span style="color: #4ec9b0;">ReadlineError</span>&gt; {
        <span style="color: #569cd6;">use</span> <span style="color: #4ec9b0;">ValidationResult</span>::{
            <span style="color: #4ec9b0;">Incomplete</span>,
            <span style="color: #4ec9b0;">Invalid</span>,
            <span style="color: #4ec9b0;">Valid</span>
        };

        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">input</span> = ctx.input();
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">ignore_one</span> = <span style="color: #569cd6;">false</span>;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">count</span> = 0;
        <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">c</span> <span style="color: #569cd6;">in</span> input.chars() {
            <span style="color: #569cd6;">if</span> ignore_one {
                ignore_one = <span style="color: #569cd6;">false</span>;
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">match</span> c {
                    <span style="color: #ce9178;">'('</span> =&gt; {
                        count += 1;
                    },
                    <span style="color: #ce9178;">')'</span> =&gt; {
                        <span style="color: #569cd6;">if</span> count == 0 {
                            count = -1;
                            <span style="color: #569cd6;">break</span>;
                        } <span style="color: #569cd6;">else</span> {
                            count -= 1;
                        }
                    },
                    <span style="color: #ce9178;">'\\'</span> =&gt; {
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Gambiarra for preventing</span>
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">incomplete input on characters</span>
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">such as #\( and #\)</span>
                        ignore_one = <span style="color: #569cd6;">true</span>;
                    }
                    _ =&gt; {},
                }
            }
        }

        <span style="color: #569cd6;">if</span> count &gt; 0 {
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Incomplete</span>)
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> count &lt; 0 {
            <span style="color: #4ec9b0;">Ok</span>(
                <span style="color: #4ec9b0;">Invalid</span>(<span style="color: #4ec9b0;">Some</span>(<span style="color: #ce9178;">"No matching parenthesis found"</span>
                             .to_owned()))
            )
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Valid</span>(<span style="color: #4ec9b0;">None</span>))
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">repl</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">options</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">ArgsOptions</span>) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_errorp;
    <span style="color: #569cd6;">if</span> !options.silent {
        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Press C-c or C-d to quit"</span>);
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">validator</span> = <span style="color: #4ec9b0;">MajInputValidator</span> {};

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">rl</span> = <span style="color: #4ec9b0;">Editor</span>::new();
    rl.set_helper(<span style="color: #4ec9b0;">Some</span>(validator));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = rl.load_history(<span style="color: #ce9178;">".majestic_history"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">prompt</span> = <span style="color: #569cd6;">if</span> options.silent {
        <span style="color: #4ec9b0;">String</span>::from(<span style="color: #ce9178;">""</span>)
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"&gt; "</span>.green())
    };

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">show_tokens</span> = <span style="color: #569cd6;">false</span>;

    <span style="color: #569cd6;">loop</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">readline</span> = rl.readline(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>prompt);
        <span style="color: #569cd6;">match</span> readline {
            <span style="color: #4ec9b0;">Ok</span>(line) =&gt; {
                rl.add_history_entry(line.as_str());
                <span style="color: #569cd6;">if</span> line == <span style="color: #ce9178;">"#t"</span> {
                    show_tokens = !show_tokens;
                    prompt =
                        <span style="color: #569cd6;">if</span> options.silent {
                            <span style="color: #4ec9b0;">String</span>::from(<span style="color: #ce9178;">""</span>)
                        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> show_tokens {
                            <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"&gt; "</span>.magenta())
                        } <span style="color: #569cd6;">else</span> {
                            <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"&gt; "</span>.green())
                        };
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #6a9955;">//</span><span style="color: #6a9955;">use crate::printing::maj_pretty_format;</span>
                    <span style="color: #569cd6;">match</span> maj_tokenize(line.as_ref()) {
                        <span style="color: #4ec9b0;">Ok</span>(tokens) =&gt; {
                            <span style="color: #569cd6;">if</span> show_tokens {
                                <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                         <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{:?}</span><span style="color: #ce9178;">"</span>, tokens)
                                         .magenta());
                            }
                            <span style="color: #569cd6;">match</span> maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                                  tokens.clone()) {
                                <span style="color: #4ec9b0;">Ok</span>(expressions) =&gt; {
                                    <span style="color: #569cd6;">if</span> show_tokens {
                                        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                                 maj_format_raw(
                                                     <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state,
                                                     expressions.clone(),
                                                     <span style="color: #569cd6;">false</span>).magenta());
                                    }
                                    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::{
                                        <span style="color: #4ec9b0;">STACK_RED_ZONE</span>,
                                        <span style="color: #4ec9b0;">STACK_PER_RECURSION</span>
                                    };
                                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">results</span> =
                                        <span style="color: #569cd6;">stacker</span>::maybe_grow(
                                            <span style="color: #4ec9b0;">STACK_RED_ZONE</span>,
                                            <span style="color: #4ec9b0;">STACK_PER_RECURSION</span>,
                                            || maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                                        <span style="color: #4ec9b0;">Maj</span>::cons(
                                                            <span style="color: #4ec9b0;">Maj</span>::do_sym(),
                                                            expressions),
                                                        <span style="color: #4ec9b0;">Maj</span>::nil()));
                                            <span style="color: #569cd6;">if</span> !maj_errorp(results.clone()).to_bool() {
                                                <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                                         maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, results)
                                                         .cyan());
                                            } <span style="color: #569cd6;">else</span> {
                                                <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                                          <span style="color: #ce9178;">"Error:"</span>.red().bold(),
                                                          maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, results));
                                            }
                                            
                                        },
                                    <span style="color: #4ec9b0;">Err</span>(msg) =&gt;
                                        <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                                  <span style="color: #ce9178;">"Parser error:"</span>.red().bold(),
                                                  msg),
                                }
                            },
                            <span style="color: #4ec9b0;">Err</span>((line, msg)) =&gt;
                                <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> on line </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                                          <span style="color: #ce9178;">"Syntax error"</span>.red().bold(),
                                          line, msg),
                        };
                    }
                },
                <span style="color: #4ec9b0;">Err</span>(<span style="color: #4ec9b0;">ReadlineError</span>::<span style="color: #4ec9b0;">Interrupted</span>) =&gt; {
                    <span style="color: #569cd6;">if</span> !options.silent {
                        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"C-c"</span>.cyan().dimmed());
                    }
                    <span style="color: #569cd6;">break</span>
                },
                <span style="color: #4ec9b0;">Err</span>(<span style="color: #4ec9b0;">ReadlineError</span>::<span style="color: #4ec9b0;">Eof</span>) =&gt; {
                    <span style="color: #569cd6;">if</span> !options.silent {
                        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"C-d"</span>.cyan().dimmed());
                    }
                    <span style="color: #569cd6;">break</span>
                },
                <span style="color: #4ec9b0;">Err</span>(err) =&gt; {
                    <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"REPL Error: </span><span style="color: #ce9178; font-style: italic;">{:?}</span><span style="color: #ce9178;">"</span>, err);
                    <span style="color: #569cd6;">break</span>
                }
            }
        }

        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Err</span>(_) = rl.save_history(<span style="color: #ce9178;">".majestic_history"</span>) {
            <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"Failed saving history to .majestic_history."</span>);
        }

        <span style="color: #569cd6;">if</span> !options.silent {
            <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Quaerendo invenietis."</span>);
        }
    }
</pre>
</div>
</div>
</div>
