09-ponto-de-entrada.org
* Parsing de argumentos do console

** Estrutura de argumentos

#+begin_src rust
struct ArgsOptions {
    silent:      bool,
    loadfiles:   Vec<String>,
    programname: String,
    quit:        bool,
    execlines:   Vec<String>,
    showhelp:    bool,
}
#+end_src

** Discriminação dos argumentos

#+begin_src rust
impl ArgsOptions {
    fn empty() -> ArgsOptions {
        ArgsOptions {
            silent:     false,
            loadfiles:   Vec::new(),
            programname: String::new(),
            quit:        false,
            execlines:   Vec::new(),
            showhelp:    false,
        }
    }

    fn new() -> Result<ArgsOptions, String> {
        let mut options = ArgsOptions::empty();

        let mut fetch_load        = false;
        let mut fetch_exec        = false;
        let mut fetch_programname = true;

        for argument in env::args() {
            if fetch_programname {
                options.programname = argument;
                fetch_programname = false;
            } else if fetch_load {
                options.loadfiles.push(argument);
                fetch_load = false;
            } else if fetch_exec {
                options.execlines.push(argument);
                fetch_exec = false;
            } else {
                match argument.as_ref() {
                    "--load" | "-l" => fetch_load = true,
                    "--silent" | "-s" => options.silent = true,
                    "--quit" | "-q" => options.quit = true,
                    "--eval" | "-e" => fetch_exec = true,
                    "--help" | "-h" | "-?" =>
                        options.showhelp = true,
                    "--script" => {
                        options.silent = true;
                        options.quit = true;
                        fetch_load = true;
                    },
                    _ => return Err(
                        format!("Unknown argument: {}", argument)),
                }
            }
        }
        Ok(options)
    }
}
#+end_src

* Utilitários
** Constantes de compilação

#+begin_src rust
static TIMESTAMP: &'static str = include_str!(
    concat!(env!("OUT_DIR"), "/timestamp.txt"));

static VERSION: &'static str = include_str!(
    concat!(env!("OUT_DIR"), "/version.txt"));

static TARGET: &'static str = include_str!(
    concat!(env!("OUT_DIR"), "/target.txt"));
#+end_src

** Carregando arquivos

#+begin_src rust
fn handle_load_file(options: &ArgsOptions, mut state: &mut MajState) {
    use crate::axioms::primitives::maj_load;
    use crate::axioms::predicates::maj_errorp;
    for file in &options.loadfiles {
        if !options.silent {
            println!("; loading {}...", file);
        }
        let results =
            maj_load(&mut state, Maj::nil(), Maj::string(file));
        if maj_errorp(results.clone()).to_bool() {
            eprintln!("{} {}", "Error:".red().bold(),
                      maj_format(&state, results));
            if options.quit {
                process::exit(1);
            }
        }
    }
}
#+end_src

