doc/html/09-ponto-de-entrada.html

<div id="outline-container-org01b28da" class="outline-2">
<h2 id="org01b28da"><span class="section-number-2">4.</span> Parsing de argumentos do console</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9611725" class="outline-3">
<h3 id="org9611725"><span class="section-number-3">4.1.</span> Estrutura de argumentos</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">ArgsOptions</span> {
    <span style="color: #9cdcfe;">silent</span>:      <span style="color: #4ec9b0;">bool</span>,
    <span style="color: #9cdcfe;">loadfiles</span>:   <span style="color: #4ec9b0;">Vec</span>&lt;<span style="color: #4ec9b0;">String</span>&gt;,
    <span style="color: #9cdcfe;">programname</span>: <span style="color: #4ec9b0;">String</span>,
    <span style="color: #9cdcfe;">quit</span>:        <span style="color: #4ec9b0;">bool</span>,
    <span style="color: #9cdcfe;">execlines</span>:   <span style="color: #4ec9b0;">Vec</span>&lt;<span style="color: #4ec9b0;">String</span>&gt;,
    <span style="color: #9cdcfe;">showhelp</span>:    <span style="color: #4ec9b0;">bool</span>,
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d9be6f" class="outline-3">
<h3 id="org3d9be6f"><span class="section-number-3">4.2.</span> Discriminação dos argumentos</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">ArgsOptions</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">empty</span>() -&gt; <span style="color: #4ec9b0;">ArgsOptions</span> {
        <span style="color: #4ec9b0;">ArgsOptions</span> {
            <span style="color: #9cdcfe;">silent</span>:     <span style="color: #569cd6;">false</span>,
            <span style="color: #9cdcfe;">loadfiles</span>:   <span style="color: #4ec9b0;">Vec</span>::new(),
            <span style="color: #9cdcfe;">programname</span>: <span style="color: #4ec9b0;">String</span>::new(),
            <span style="color: #9cdcfe;">quit</span>:        <span style="color: #569cd6;">false</span>,
            <span style="color: #9cdcfe;">execlines</span>:   <span style="color: #4ec9b0;">Vec</span>::new(),
            <span style="color: #9cdcfe;">showhelp</span>:    <span style="color: #569cd6;">false</span>,
        }
    }

    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">new</span>() -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">ArgsOptions</span>, <span style="color: #4ec9b0;">String</span>&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">options</span> = <span style="color: #4ec9b0;">ArgsOptions</span>::empty();

        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">fetch_load</span>        = <span style="color: #569cd6;">false</span>;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">fetch_exec</span>        = <span style="color: #569cd6;">false</span>;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">fetch_programname</span> = <span style="color: #569cd6;">true</span>;

        <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">argument</span> <span style="color: #569cd6;">in</span> <span style="color: #569cd6;">env</span>::args() {
            <span style="color: #569cd6;">if</span> fetch_programname {
                options.programname = argument;
                fetch_programname = <span style="color: #569cd6;">false</span>;
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> fetch_load {
                options.loadfiles.push(argument);
                fetch_load = <span style="color: #569cd6;">false</span>;
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> fetch_exec {
                options.execlines.push(argument);
                fetch_exec = <span style="color: #569cd6;">false</span>;
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">match</span> argument.as_ref() {
                    <span style="color: #ce9178;">"--load"</span> | <span style="color: #ce9178;">"-l"</span> =&gt; fetch_load = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">"--silent"</span> | <span style="color: #ce9178;">"-s"</span> =&gt; options.silent = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">"--quit"</span> | <span style="color: #ce9178;">"-q"</span> =&gt; options.quit = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">"--eval"</span> | <span style="color: #ce9178;">"-e"</span> =&gt; fetch_exec = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">"--help"</span> | <span style="color: #ce9178;">"-h"</span> | <span style="color: #ce9178;">"-?"</span> =&gt;
                        options.showhelp = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">"--script"</span> =&gt; {
                        options.silent = <span style="color: #569cd6;">true</span>;
                        options.quit = <span style="color: #569cd6;">true</span>;
                        fetch_load = <span style="color: #569cd6;">true</span>;
                    },
                    _ =&gt; <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(
                        <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"Unknown argument: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, argument)),
                }
            }
        }
        <span style="color: #4ec9b0;">Ok</span>(options)
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org92fbda4" class="outline-2">
<h2 id="org92fbda4"><span class="section-number-2">5.</span> Utilitários</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7577371" class="outline-3">
<h3 id="org7577371"><span class="section-number-3">5.1.</span> Constantes de compilação</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">static</span> <span style="color: #9cdcfe;">TIMESTAMP</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> = <span style="color: #c586c0;">include_str!</span>(
    <span style="color: #c586c0;">concat!</span>(<span style="color: #c586c0;">env!</span>(<span style="color: #ce9178;">"OUT_DIR"</span>), <span style="color: #ce9178;">"/timestamp.txt"</span>));

<span style="color: #569cd6;">static</span> <span style="color: #9cdcfe;">VERSION</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> = <span style="color: #c586c0;">include_str!</span>(
    <span style="color: #c586c0;">concat!</span>(<span style="color: #c586c0;">env!</span>(<span style="color: #ce9178;">"OUT_DIR"</span>), <span style="color: #ce9178;">"/version.txt"</span>));

<span style="color: #569cd6;">static</span> <span style="color: #9cdcfe;">TARGET</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> = <span style="color: #c586c0;">include_str!</span>(
    <span style="color: #c586c0;">concat!</span>(<span style="color: #c586c0;">env!</span>(<span style="color: #ce9178;">"OUT_DIR"</span>), <span style="color: #ce9178;">"/target.txt"</span>));
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae1d1e5" class="outline-3">
<h3 id="orgae1d1e5"><span class="section-number-3">5.2.</span> Carregando arquivos</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">handle_load_file</span>(<span style="color: #9cdcfe;">options</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">ArgsOptions</span>, <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_load;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_errorp;
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">file</span> <span style="color: #569cd6;">in</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>options.loadfiles {
        <span style="color: #569cd6;">if</span> !options.silent {
            <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"; loading </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">..."</span>, file);
        }
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">results</span> =
            maj_load(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::string(file));
        <span style="color: #569cd6;">if</span> maj_errorp(results.clone()).to_bool() {
            <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #ce9178;">"Error:"</span>.red().bold(),
                      maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, results));
            <span style="color: #569cd6;">if</span> options.quit {
                <span style="color: #569cd6;">process</span>::exit(1);
            }
        }
    }
}
</pre>
</div>
</div>
</div>
