09-ponto-de-entrada.org
** Execução de comandos pelo console

#+begin_src rust
fn handle_exec_evals(options: &ArgsOptions, mut state: &mut MajState) {
    for codeline in &options.execlines {
        match maj_tokenize(codeline.as_ref()) {
            Ok(tokens) => {
                match maj_parse(&mut state, tokens.clone()) {
                    Ok(expressions) => {
                        let results =
                            maj_eval(&mut state,
                                     Maj::cons(Maj::do_sym(),
                                               expressions),
                                     Maj::nil());
                        println!("{}", maj_format(&state, results)
                                 .cyan());
                    },
                    Err(msg) => {
                        eprintln!("Parser error: {}", msg)
                    },
                }
            },
            Err((line, msg)) =>
                eprintln!("Syntax error on line {}: {}",
                          line, msg),
        }
    }
}
#+end_src

** Texto de ajuda

#+begin_src rust
fn show_help(programname: String) {
    if VERSION == "" {
        println!("Built at {}", TIMESTAMP);
    }
    println!("Usage: {} [options]
Options:
\t-l, --load [file]   Load and execute contents of file
\t-s, --silent        Do not show ribbon nor REPL prompt
\t-q, --quit          Halt interpreter execution after executing
\t                    commands given through arguments
\t-e, --eval [text]   Evaluate given string of text
\t-h, -?, --help      Show this help text
\t--script [file]     Same as --silent --quit --load [file]",
             programname);
}
#+end_src

* Função ~main~

#+begin_src rust
fn main() {
    match ArgsOptions::new() {
        Ok(options) => {
            if !options.silent {
                println!("Majestic Lisp v{} {}",
                         format!("{}{}",
                                 env!("CARGO_PKG_VERSION"),
                                 if VERSION != "" { " nightly" }
                                 else { "" }),
                         TARGET);
                if VERSION != "" {
                    println!("Build {} {}", VERSION, TIMESTAMP);
                }
                println!("Copyright (c) 2020-2022 Lucas S. Vieira");
            }

            if options.showhelp {
                show_help(options.programname);
                process::exit(0);
            }

            let mut state = MajState::new();

            // Load files
            handle_load_file(&options, &mut state);

            // Execute code from console
            handle_exec_evals(&options, &mut state);

            if !options.quit {
                repl(&mut state, &options);
            }
        },
        Err(error) => {
            eprintln!("Arguments error: {}", error);
            show_help(String::from("majestic"));
            process::exit(1);
        }
    }
}
#+end_src
