doc/html/09-ponto-de-entrada.html

<div id="outline-container-org0e9dbc8" class="outline-3">
<h3 id="org0e9dbc8"><span class="section-number-3">5.3.</span> Execução de comandos pelo console</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">handle_exec_evals</span>(<span style="color: #9cdcfe;">options</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">ArgsOptions</span>, <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">codeline</span> <span style="color: #569cd6;">in</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>options.execlines {
        <span style="color: #569cd6;">match</span> maj_tokenize(codeline.as_ref()) {
            <span style="color: #4ec9b0;">Ok</span>(tokens) =&gt; {
                <span style="color: #569cd6;">match</span> maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, tokens.clone()) {
                    <span style="color: #4ec9b0;">Ok</span>(expressions) =&gt; {
                        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">results</span> =
                            maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                     <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::do_sym(),
                                               expressions),
                                     <span style="color: #4ec9b0;">Maj</span>::nil());
                        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, results)
                                 .cyan());
                    },
                    <span style="color: #4ec9b0;">Err</span>(msg) =&gt; {
                        <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"Parser error: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, msg)
                    },
                }
            },
            <span style="color: #4ec9b0;">Err</span>((line, msg)) =&gt;
                <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"Syntax error on line </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                          line, msg),
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org25abde6" class="outline-3">
<h3 id="org25abde6"><span class="section-number-3">5.4.</span> Texto de ajuda</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">show_help</span>(<span style="color: #9cdcfe;">programname</span>: <span style="color: #4ec9b0;">String</span>) {
    <span style="color: #569cd6;">if</span> <span style="color: #4ec9b0;">VERSION</span> == <span style="color: #ce9178;">""</span> {
        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Built at </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #4ec9b0;">TIMESTAMP</span>);
    }
    <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Usage: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> [options]</span>
<span style="color: #ce9178;">Options:</span>
<span style="color: #ce9178;">\t-l, --load [file]   Load and execute contents of file</span>
<span style="color: #ce9178;">\t-s, --silent        Do not show ribbon nor REPL prompt</span>
<span style="color: #ce9178;">\t-q, --quit          Halt interpreter execution after executing</span>
<span style="color: #ce9178;">\t                    commands given through arguments</span>
<span style="color: #ce9178;">\t-e, --eval [text]   Evaluate given string of text</span>
<span style="color: #ce9178;">\t-h, -?, --help      Show this help text</span>
<span style="color: #ce9178;">\t--script [file]     Same as --silent --quit --load [file]"</span>,
             programname);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org79a797c" class="outline-2">
<h2 id="org79a797c"><span class="section-number-2">6.</span> Função <code>main</code></h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">main</span>() {
    <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">ArgsOptions</span>::new() {
        <span style="color: #4ec9b0;">Ok</span>(options) =&gt; {
            <span style="color: #569cd6;">if</span> !options.silent {
                <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Majestic Lisp v</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                         <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}{}</span><span style="color: #ce9178;">"</span>,
                                 <span style="color: #c586c0;">env!</span>(<span style="color: #ce9178;">"CARGO_PKG_VERSION"</span>),
                                 <span style="color: #569cd6;">if</span> <span style="color: #4ec9b0;">VERSION</span> != <span style="color: #ce9178;">""</span> { <span style="color: #ce9178;">" nightly"</span> }
                                 <span style="color: #569cd6;">else</span> { <span style="color: #ce9178;">""</span> }),
                         <span style="color: #4ec9b0;">TARGET</span>);
                <span style="color: #569cd6;">if</span> <span style="color: #4ec9b0;">VERSION</span> != <span style="color: #ce9178;">""</span> {
                    <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Build </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #4ec9b0;">VERSION</span>, <span style="color: #4ec9b0;">TIMESTAMP</span>);
                }
                <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Copyright (c) 2020-2023 Lucas S. Vieira"</span>);
            }

            <span style="color: #569cd6;">if</span> options.showhelp {
                show_help(options.programname);
                <span style="color: #569cd6;">process</span>::exit(0);
            }

            <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Load files</span>
            handle_load_file(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>options, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);

            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Execute code from console</span>
            handle_exec_evals(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>options, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);

            <span style="color: #569cd6;">if</span> !options.quit {
                repl(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>options);
            }
        },
        <span style="color: #4ec9b0;">Err</span>(error) =&gt; {
            <span style="color: #c586c0;">eprintln!</span>(<span style="color: #ce9178;">"Arguments error: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, error);
            show_help(<span style="color: #4ec9b0;">String</span>::from(<span style="color: #ce9178;">"majestic"</span>));
            <span style="color: #569cd6;">process</span>::exit(1);
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2023-01-27 sex 22:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
